import random

HANGMANPICS = [
    """
  +---+
  |   |
      |
      |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
      |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
  |   |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|   |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\  |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\  |
 /    |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\  |
 / \\  |
      |
=========""",
]

COMMON_NOUNS = [
    "время", "человек", "год", "дело", "день",
    "рука", "раз", "город", "слово", "место",
    "лицо", "друг", "глаз", "вопрос", "дом",
    "сторона", "страна", "мир", "случай", "голова",
    "ребёнок", "сила", "конец", "вид", "система",
    "часть", "работа", "жизнь", "власть", "женщина",
    "дорога", "образ", "отец", "история", "нога",
    "вода", "война", "любовь", "минута", "право",
    "небо", "сын", "душа", "утро", "вечер",
    "месяц", "комната", "ночь", "мать", "вещь",
    "цель", "народ", "сердце", "шаг", "девушка",
    "машина", "уровень", "окно", "ответ", "условие",
    "начало", "свет", "действие", "век", "школа",
    "газета", "плечо", "путь", "дверь", "язык",
    "любовь", "порядок", "автор", "гость", "закон",
    "число", "идея", "смерть", "сон", "ресурс",
    "лес", "проблема", "искусство", "река", "проект",
    "журнал", "стена", "товарищ", "книга", "письмо",
    "помощь", "группа", "участие",
]

def main():
    print("Добро пожаловать в игру Виселица!")
    print("Основная цель игры: угадать случайное слово из заданного списка. Игроку будет предложено угадать слово и он будет получать подсказки о правильности своего выбора.")
    
    while True:
        answer = random.choice(COMMON_NOUNS)
        guesses = []                                   
        attempts = 6
        game_over = False

        while not game_over:
            print(HANGMANPICS[6 - attempts])
            print("Слово: ", display_word(answer, guesses))
            print(f"Оставшиеся попытки: {attempts}")
            guess = input("Введите одну букву: ")

            if not guess.isalpha() or len(guess) != 1:
                print("Ошибка: введите только одну букву.")
                continue

            if guess in guesses:
                print("Вы уже угадали эту букву. Попробуйте другую.")
                continue

            guesses.append(guess)

            if guess in answer:
                print("Вы угадали букву!")
            else:
                print("К сожалению, буквы нет в слове.")
                attempts -= 1

            if all(letter in guesses for letter in answer):
                print(f"Поздравляем! Вы угадали слово: {answer}")
                game_over = True
            elif attempts == 0:
                print(HANGMANPICS[6])
                print(f"Вы проиграли! Загаданное слово было: {answer}")
                game_over = True

        play_again = input("Хотите сыграть снова? (да/нет): ")
        if play_again != 'да':
            print("Спасибо за игру! До свидания!")
            break

def display_word(word, guesses):
    return ' '.join([letter if letter in guesses else '_' for letter in word])

main()